#!/usr/bin/env python
# -*- coding: utf-8 -*- 
import re
filename_of_out_file = "decoded.txt"
regexp = re.compile(r':\b', re.UNICODE)
statia=r'''
Алтын тамсы: баш7орт халы7 2ки2тт2ре/ т06. Р. М. З2йтунова. - )ф0: Китап, 2017. – 23 б. 
Был китапта кеск2й62р 0с0н 2ки2тт2р йыйыл4ан. Улар6ы у7ып 3е6 “Тамсы ни 0с0н алтын?”, “Мо8до8 сере ни62?”, “Б2хет ни 0с0н юлда табыл4ан?” тиг2н 3орау6ар4а яуап таба аласа73ы4ы6.
\n
«хм2т7ужина, Г. Ф. Бете1: повестар, хик2й2л2р, эсселар/Г. Ф. «хм2т7ужина. - )ф0: Китап, 2017. – 336 б.
Автор6ы8 я8ы йыйынты4ына, башлыса, ф2лс2ф21и 292р62р индерелг2н. Языусы 16ене8 эссе 32м повестарында, хик2й2л2ренд2 й2ш21 32м 1лем, изгелек 32м яуызлы7 ке1ек м28гелек т0ш0нс2л2рг2 м0р2ж242т ит2. Китап ки8 7атлы у7ыусылар4а и92пл2нг2н  
\n
З2йн2б Биишева: м272л2л2р, ижади портреттар, арнау6ар, и9т2лект2р/ т06. К. Аралбаев. - )ф0: Китап, 2017. – 269 б. 
Хал7ыбы6 яратып у7ы4ан оло быуын 26иб23е – З2йн2б Абдулла 7ы6ы Биишеваны8 х2тир2л2ре, й2шлек э662ре буйлап 1тк2нд2н тыу4ан с2й2х2т я6малары, я8ы тормош т0з01г2, милли с2н42т, м262ни2т 32м 262би2тк2 7а4ылышлы м272л2л2ре, я6ыусыны8 тос ижады ха7ында замандаштарыны8 уй-фекер62ре, ши4ри арнау6ары 32м 0лк2н улы Тельман ;2зиз улы «миневты8 йылы и9т2лект2ре индерелде китап7а. Халы7 я6ыусы3ыны8 тыуыуына 110 йыл тулыу4а ба4ышлап н2шер ител2. 
\n
;айсарова-;изз2туллина, Г. М.
№0й01ем до4а3ы: повесть, хик2й2л2р/ ;. М. ;айсарова-;изз2туллина. - 
)ф0: Китап, 2017. – 280 б. 

Г0лсир2 ;айсарова-;изз2туллинаны8 был китабына туплан4ан 292р62р тормоштан алын4ан ми9алдар мен2н был х2кик2тте та4ы ла бер тап7ыр ра9лай. №0й01 бе6г2 т0рл0 7и2ф2тт2 кил2, тик уны к1рерг2 32м а8лар4а 32л2тебе6 бармы? « бит 262м бала3ыны8 б2хете туранан-тура шу4а б2йл2нг2н. 
Неск2 юмор, н2фис той4олар, автор6ы8 б0тм29-т0к2нм29 30й01е мен2н 3у4арыл4ан образдар – был китап 1зене8 и4тибарлы у7ыусы3ына ысын м242н23енд2 б2хетле м2лд2р б1л2к итерг2 32л2тле.  
\n
;али2ск2рова, ;. М. Осор4осло б2пемб2л2р: ши4ыр6ар, йома7тар, 2ки2тт2р/ ;. М. ;2ли2ск2рова. - )ф0: Китап, 2017. – 90 б. 
Был китапта автор6ы8 ке9к2й62р 0с0н тыу4ан я7, т2би42т к1ренешт2ре, 19емлект2р, хайуандар донъя3ы, алфавит х2рефт2ре, 3андар тура3ында т0рл0 ши4ыр6ары, йома7тары 7ы6ы7лы 2ки2тт2ре т27дим ител2. 
\n
Муллагалиева, З. М. Ак яулыклы тау:әкиятләр, хикәятләр, риваятьләр/ З. М. Муллагалиева. – Уфа: Китап, 2017. – 173 б. 
Земфира Муллагалиеваның бу китабына төрле жанрдагы әсәрләре тупланды. Автор Дим буе табигатенең матурлыгын, андагы җәнлек һәм кошлар, үсемлекләр дөньясындагы маҗаралары хәлләрне, балачак хатирәләре белән бергә үреп, үзенең нәни герое исеменнән бәян итә. Могҗизалы һәм серле әкиятләр укучылар күңеленә хуш килер мөгаен.
\n
Ш2рифуллина, Э. М. М0х2бб2тте8 ете т090: повестар 32м хик2й2л2р/ 
Э. М. Ш2рифуллина. - )ф0: Китап, 2017. – 277 б.

Атай-2с2й 726ере, Тыу4ан ер б0й0кл0г0, й2й4ор6о8 ете т090н 3е8дерг2н М0х2бб2т 4азаптары – м2керле л2, л2зз2тле л2 41мер би62г2н Ва7ыт 4али й2н2пт2ре бизм2ненд2 бер ми6гелг2 ти8. «мм2 к16 асып йом4ан арауы7та4ы был й2ш2йешебе66е8 б2р2к2те, 7имм2те ним2л2? Языусы Эльмира Ш2рифуллинаны8 психологик кисерешт2р мен2н ижад ителг2н проза 292р62ре у7ыусыны шул ха7та уйланыр4а са7ыра. 
\n



'''

statia = re.sub(r'«', 'Ә',statia)	
statia = re.sub(r'1', 'ү',statia)	
statia = re.sub(r'!', 'Ү',statia)	
statia = re.sub(r'2', 'ә',statia)	
statia = re.sub(r'"', 'Ә',statia)	
statia = re.sub(r'3', 'һ',statia)	
statia = re.sub(r'№', 'Һ',statia)	
statia = re.sub(r'4', 'ғ',statia)	
statia = re.sub(r';', 'Ғ',statia)	
statia = re.sub(r'5', 'ҫ',statia)	
statia = re.sub(r'%', 'Ҫ',statia)	
statia = re.sub(r'6', 'ҙ',statia)	
statia = regexp.sub('Ҙ',statia) 	
statia = re.sub(r'7', 'ҡ',statia)	
statia = re.sub(r"\?", 'Ҡ',statia)	
statia = re.sub(r'8', 'ң',statia)	
statia = re.sub(r'\*', 'Ң',statia)	
statia = re.sub(r'9', 'ҫ',statia)	
statia = re.sub(r"\(", 'Ҫ',statia)	
statia = re.sub(r'0', 'ө',statia)	
statia = re.sub(r'\)', 'Ө',statia)«


with open(filename_of_out_file, 'w', encoding='utf-8') as f:
	f.write(statia)


#result = re.sub(r':\b', 'BASHSTR',A)

